STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient_Ext/STM32_WPAN/App/app_ble.c
        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */

        default:
          /* USER CODE BEGIN ecode_default */

          /* USER CODE END ecode_default */
          break;

      }
    }
    break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n\r");
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);
        }
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      meta_evt = (evt_le_meta_event*) event_pckt->data;

      switch (meta_evt->subevent)
      {
      /* USER CODE BEGIN subevent */

      /* USER CODE END subevent */
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

          /* USER CODE END EVT_LE_CONN_COMPLETE */
          /**
           * The connection is done,
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
          BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

          /* CONNECTION WITH CLIENT */
          APP_DBG_MSG("\r\n\r** CONNECTION EVENT WITH SERVER \n");
          handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);

          result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
          if (result == BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n");
            APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
          }
          else
          {
            APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
          }

          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
          
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_connection_complete_event;
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) meta_evt->data;
          
          APP_DBG_MSG(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%x\n", p_enhanced_connection_complete_event->Connection_Handle);
          APP_DBG_MSG("     - Connection established with Central: @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_connection_complete_event->Peer_Address[5],
                      p_enhanced_connection_complete_event->Peer_Address[4],
                      p_enhanced_connection_complete_event->Peer_Address[3],
                      p_enhanced_connection_complete_event->Peer_Address[2],
                      p_enhanced_connection_complete_event->Peer_Address[1],
                      p_enhanced_connection_complete_event->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                      p_enhanced_connection_complete_event->Conn_Interval*1.25,
                      p_enhanced_connection_complete_event->Conn_Latency,
                      p_enhanced_connection_complete_event->Supervision_Timeout*10
                        );
          if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = p_enhanced_connection_complete_event->Connection_Handle;
          /* USER CODE BEGIN HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
          
          /* USER CODE END HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */

        }
          break;
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        { 
          ext_adv_evt = (hci_le_extended_advertising_report_event_rp0 *) meta_evt->data;
          
          if ((disp_filter != 0) && HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0010))
          {
            break;
          }
          
          l_buff_pos = 0;
          memset(&l_buff[l_buff_pos], 0, L_BUFF_SIZE);          

          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, 
                                  "%02x:%02x:%02x:%02x:%02x:%02x | "
                                  ,ext_adv_evt->Address[5], ext_adv_evt->Address[4]
                                  ,ext_adv_evt->Address[3] ,ext_adv_evt->Address[2]
                                  ,ext_adv_evt->Address[1] ,ext_adv_evt->Address[0]);
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0010))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "LEGACY   |");
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "EXTENDED |");
          }
          
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%4d | ",(int8_t)ext_adv_evt->RSSI );
                    
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0001))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "CONN |");
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "     |");
          }
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0002))
          {
            if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0008))
            {
              l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN RSP |");
            }
            else
            {
              l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN     |");
            }
          }
          else
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "         |");
          }
          
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%3d | ",ext_adv_evt->Data_Length );
          
          if (ext_adv_evt->Advertising_SID != 0xFF)
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%2d | ",ext_adv_evt->Advertising_SID );
          }
          
          if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0020))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "more data   | ");
          }
          else if (HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0040))
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "trunc data | ");
          }
          else
          {
            /* Nothing to do */
          }          

          k = 0;
          while ( k < ext_adv_evt->Data_Length )
          {
            adlength = ext_adv_evt->Data[k];
            adtype = ext_adv_evt->Data[k + 1];
            if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
            {
              if ( (adlength >= 7) && (ext_adv_evt->Data[k + 2] == 0x01) )
              {
                if (ext_adv_evt->Data[k + 3] == CFG_DEV_ID_P2P_SERVER1)
                {
                  if ( HAL_IS_BIT_CLR(ext_adv_evt->Event_Type, 0x0010) && 
                        HAL_IS_BIT_SET(ext_adv_evt->Event_Type, 0x0001))
                  {
                    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "server detected via MAN ID, address recorded to connect. | ");
                    BleApplicationContext.DeviceServerFound = 0x01;
                    ext_adv_server_remote_bd_addr[0] = ext_adv_evt->Address[0];
                    ext_adv_server_remote_bd_addr[1] = ext_adv_evt->Address[1];
                    ext_adv_server_remote_bd_addr[2] = ext_adv_evt->Address[2];
                    ext_adv_server_remote_bd_addr[3] = ext_adv_evt->Address[3];
                    ext_adv_server_remote_bd_addr[4] = ext_adv_evt->Address[4];
                    ext_adv_server_remote_bd_addr[5] = ext_adv_evt->Address[5];
                    ext_adv_address_type = ext_adv_evt->Address_Type;
                  }
                }
              }
            }
            else if(adtype == AD_TYPE_COMPLETE_LOCAL_NAME)
            {
              memcpy(&l_buff[l_buff_pos], &ext_adv_evt->Data[k + 2], adlength - 1);
              l_buff_pos += adlength - 1;
            }
            k += adlength + 1;
          }
          l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
          
